Repository: makinananya-cyber/HisaabWiseIOS
Catalog: HisaabWise/HisaabWise/Resources/Localizable.xcstrings
Source language: en
Languages: ar, hi

# learn.player.answer.hint
source: Whole numbers are fine — no commas needed.
ar: الأرقام الصحيحة كافية — لا حاجة للفواصل.
hi: पूर्ण संख्याएँ ठीक हैं — अल्पविराम की ज़रूरत नहीं।

# learn.player.answer.label
source: Your answer
ar: إجابتك
hi: आपका उत्तर

# learn.player.check
source: Check
ar: تحقّق
hi: जाँचें

# learn.player.combo %@
source: Combo ×%@
ar: تتابع ×%@
hi: कॉम्बो ×%@

# learn.player.combo.announcement %@
source: Combo — %@ right in a row
ar: تتابع — %@ إجابات صحيحة متتالية
hi: कॉम्बो — लगातार %@ सही

# learn.player.continue
source: Continue
ar: متابعة
hi: जारी रखें

# learn.player.encourage.1
source: Not quite
ar: ليس تمامًا
hi: पूरी तरह नहीं

# learn.player.encourage.2
source: Close one
ar: اقتربت
hi: करीब था

# learn.player.encourage.3
source: Almost
ar: كدت تصيب
hi: लगभग

# learn.player.encourage.4
source: Nearly there
ar: أوشكت
hi: बस पहुँचने ही वाले थे

# learn.player.gotIt
source: Got it
ar: فهمت
hi: समझ गया

# learn.player.hearts.accessibilityLabel %@ %@
source: %1$@ of %2$@ hearts left
ar: بقي %1$@ من %2$@ قلوب
hi: %2$@ में से %1$@ दिल शेष

# learn.player.kicker %@ %@
source: Unit %1$@ · %2$@
ar: الوحدة %1$@ · %2$@
hi: इकाई %1$@ · %2$@

# learn.player.kind.multi
source: Pick every right answer
ar: اختر كل إجابة صحيحة
hi: हर सही उत्तर चुनें

# learn.player.kind.numeric
source: Type the number
ar: اكتب الرقم
hi: संख्या लिखें

# learn.player.kind.single
source: Choose one
ar: اختر واحدة
hi: एक चुनें

# learn.player.option.chosen
source: Chosen
ar: مُختار
hi: चुना गया

# learn.player.option.right
source: The right answer
ar: الإجابة الصحيحة
hi: सही उत्तर

# learn.player.option.wrong
source: Your answer, and it is wrong
ar: إجابتك، وهي خاطئة
hi: आपका उत्तर, और यह गलत है

# learn.player.outOfHearts.leave
source: Back to the path
ar: العودة إلى المسار
hi: पथ पर वापस

# learn.player.outOfHearts.message
source: That's alright — the tricky ones are the ones worth repeating. Run the lesson again and it will stick.
ar: لا بأس — الأسئلة الصعبة هي التي تستحق التكرار. أعد الدرس مرة أخرى وسيرسخ في ذهنك.
hi: कोई बात नहीं — मुश्किल सवाल ही दोहराने लायक होते हैं। पाठ को दोबारा करें और यह ज़हन में बैठ जाएगा।

# learn.player.outOfHearts.retry
source: Try again
ar: حاول مرة أخرى
hi: फिर से कोशिश करें

# learn.player.outOfHearts.title
source: Out of hearts
ar: نفدت القلوب
hi: दिल खत्म

# learn.player.praise.1
source: Nice!
ar: رائع!
hi: बढ़िया!

# learn.player.praise.2
source: Exactly right!
ar: صحيح تمامًا!
hi: बिल्कुल सही!

# learn.player.praise.3
source: You got it!
ar: أصبتها!
hi: आपने कर दिखाया!

# learn.player.praise.4
source: Spot on!
ar: في الصميم!
hi: एकदम सटीक!

# learn.player.praise.5
source: Well played!
ar: أحسنت!
hi: शाबाश!

# learn.player.praise.6
source: That is it!
ar: هذا هو!
hi: यही है!

# learn.player.praise.7
source: Sharp!
ar: ذكاء!
hi: तेज़!

# learn.player.progress.accessibilityLabel %@ %@
source: Step %1$@ of %2$@
ar: الخطوة %1$@ من %2$@
hi: चरण %1$@ / %2$@

# learn.player.rightAnswer
source: The right answer:
ar: الإجابة الصحيحة:
hi: सही उत्तर:

# learn.player.tip
source: Remember it:
ar: تذكّرها:
hi: इसे याद रखें:

# learn.start
source: START
ar: ابدأ
hi: शुरू करें

# learn.title
source: Learn
ar: تعلّم
hi: सीखें

# learn.unit.caption %@ %@
source: Unit %1$@ · %2$@
ar: الوحدة %1$@ · %2$@
hi: इकाई %1$@ · %2$@

# recovery.done.action
source: Sign in
ar: تسجيل الدخول
hi: साइन इन करें

# recovery.done.blurb
source: You can sign in with your new password now. Any other device that was signed in has been signed out.
ar: يمكنك الآن تسجيل الدخول بكلمة مرورك الجديدة. تم تسجيل خروج أي جهاز آخر كان مُسجَّل الدخول.
hi: अब आप अपने नए पासवर्ड से साइन इन कर सकते हैं। जो भी अन्य डिवाइस साइन इन था, उसे साइन आउट कर दिया गया है।

# recovery.done.heading
source: Password reset
ar: تمت إعادة تعيين كلمة المرور
hi: पासवर्ड रीसेट हुआ

# recovery.email.action
source: Continue
ar: متابعة
hi: जारी रखें

# recovery.email.blurb
source: Enter the email address you registered with. We will show you the two security questions you chose.
ar: أدخل البريد الإلكتروني الذي سجّلت به. سنعرض لك سؤالَي الأمان اللذين اخترتهما.
hi: वह ईमेल पता दर्ज करें जिससे आपने पंजीकरण किया था। हम आपको वे दो सुरक्षा प्रश्न दिखाएँगे जो आपने चुने थे।

# recovery.email.heading
source: First, which account?
ar: أولًا، أي حساب؟
hi: पहले, कौन सा खाता?

# recovery.email.label
source: Email
ar: البريد الإلكتروني
hi: ईमेल

# recovery.error.answerMissing
source: Answer both questions.
ar: أجب عن السؤالين.
hi: दोनों प्रश्नों के उत्तर दें।

# recovery.error.dateOfBirthMissing
source: Choose your date of birth.
ar: اختر تاريخ ميلادك.
hi: अपनी जन्मतिथि चुनें।

# recovery.error.emailMissing
source: Enter the email address you registered with.
ar: أدخل البريد الإلكتروني الذي سجّلت به.
hi: वह ईमेल पता दर्ज करें जिससे आपने पंजीकरण किया था।

# recovery.error.identityRefused
source: That did not match what we hold for this account. Check your answers and your date of birth.
ar: لا يطابق ذلك ما لدينا لهذا الحساب. تحقّق من إجاباتك وتاريخ ميلادك.
hi: यह इस खाते के लिए हमारे पास मौजूद जानकारी से मेल नहीं खाया। अपने उत्तर और अपनी जन्मतिथि जाँचें।

# recovery.error.locked
source: Too many attempts. Wait a little while and try again.
ar: محاولات كثيرة جدًا. انتظر قليلًا ثم حاول مرة أخرى.
hi: बहुत अधिक प्रयास। थोड़ी देर रुकें और फिर से कोशिश करें।

# recovery.error.passwordMissing
source: Choose a new password.
ar: اختر كلمة مرور جديدة.
hi: एक नया पासवर्ड चुनें।

# recovery.error.passwordTooShort
source: Use at least 8 characters.
ar: استخدم 8 أحرف على الأقل.
hi: कम से कम 8 वर्णों का उपयोग करें।

# recovery.error.passwordsDiffer
source: Those two do not match.
ar: الكلمتان غير متطابقتين.
hi: वे दोनों मेल नहीं खाते।

# recovery.error.ticketExpired
source: That took too long. Answer your questions again to continue.
ar: استغرق ذلك وقتًا طويلًا. أجب عن أسئلتك مرة أخرى للمتابعة.
hi: इसमें बहुत समय लग गया। जारी रखने के लिए अपने प्रश्नों के उत्तर फिर से दें।

# recovery.identity.action
source: Check my answers
ar: تحقّق من إجاباتي
hi: मेरे उत्तर जाँचें

# recovery.identity.answer.label
source: Your answer
ar: إجابتك
hi: आपका उत्तर

# recovery.identity.blurb
source: Capital letters and exact wording do not matter — just get the key words right. Your date of birth is needed too.
ar: لا تهم حالة الأحرف ولا الصياغة الدقيقة — يكفي أن تصيب الكلمات الأساسية. ونحتاج أيضًا إلى تاريخ ميلادك.
hi: बड़े-छोटे अक्षर और सटीक शब्दावली मायने नहीं रखती — बस मुख्य शब्द सही रखें। आपकी जन्मतिथि भी चाहिए।

# recovery.identity.dob.label
source: Date of birth
ar: تاريخ الميلاد
hi: जन्मतिथि

# recovery.identity.dob.placeholder
source: Choose your date of birth
ar: اختر تاريخ ميلادك
hi: अपनी जन्मतिथि चुनें

# recovery.identity.heading
source: Answer your security questions
ar: أجب عن أسئلة الأمان
hi: अपने सुरक्षा प्रश्नों के उत्तर दें

# recovery.password.action
source: Reset password
ar: إعادة تعيين كلمة المرور
hi: पासवर्ड रीसेट करें

# recovery.password.blurb
source: Pick something you don't use anywhere else. Eight characters minimum.
ar: اختر كلمة لا تستخدمها في أي مكان آخر. ثمانية أحرف كحد أدنى.
hi: कुछ ऐसा चुनें जो आप कहीं और उपयोग न करते हों। कम से कम आठ वर्ण।

# recovery.password.confirm.label
source: Confirm new password
ar: تأكيد كلمة المرور الجديدة
hi: नया पासवर्ड पुष्टि करें

# recovery.password.heading
source: Create a new password
ar: أنشئ كلمة مرور جديدة
hi: नया पासवर्ड बनाएँ

# recovery.password.new.label
source: New password
ar: كلمة المرور الجديدة
hi: नया पासवर्ड

# recovery.step %@ %@
source: Step %1$@ of %2$@
ar: الخطوة %1$@ من %2$@
hi: चरण %1$@ / %2$@

# recovery.support
source: Still stuck? Contact support and we will help you prove the account is yours.
ar: ما زلت عالقًا؟ تواصل مع الدعم وسنساعدك على إثبات ملكيتك للحساب.
hi: अब भी अटके हैं? सहायता से संपर्क करें और हम यह साबित करने में आपकी मदद करेंगे कि खाता आपका है।

# recovery.title
source: Reset your password
ar: إعادة تعيين كلمة المرور
hi: अपना पासवर्ड रीसेट करें

# registration.back.toDetails
source: Back to your details
ar: العودة إلى بياناتك
hi: अपने विवरण पर वापस

# registration.back.toMoney
source: Back to your money details
ar: العودة إلى بيانات أموالك
hi: अपने पैसे के विवरण पर वापस

# registration.confirmPassword.label
source: Confirm password
ar: تأكيد كلمة المرور
hi: पासवर्ड पुष्टि करें

# registration.country.search
source: Search country or code
ar: ابحث عن دولة أو رمز
hi: देश या कोड खोजें

# registration.country.title
source: Select country code
ar: اختر رمز الدولة
hi: देश कोड चुनें

# registration.dateOfBirth.label
source: Date of birth
ar: تاريخ الميلاد
hi: जन्मतिथि

# registration.dateOfBirth.placeholder
source: Choose your date of birth
ar: اختر تاريخ ميلادك
hi: अपनी जन्मतिथि चुनें

# registration.email.label
source: Email address
ar: البريد الإلكتروني
hi: ईमेल पता

# registration.error.dateOfBirthMissing
source: Please choose your date of birth.
ar: يرجى اختيار تاريخ ميلادك.
hi: कृपया अपनी जन्मतिथि चुनें।

# registration.error.emailInvalid
source: Enter a valid email address.
ar: أدخل بريدًا إلكترونيًا صالحًا.
hi: एक मान्य ईमेल पता दर्ज करें।

# registration.error.emailTaken
source: That address already has an account. Sign in instead, or use another one.
ar: لهذا العنوان حساب بالفعل. سجّل الدخول بدلًا من ذلك، أو استخدم عنوانًا آخر.
hi: उस पते से पहले से एक खाता है। इसके बजाय साइन इन करें, या कोई दूसरा पता उपयोग करें।

# registration.error.firstAnswerMissing
source: Please answer your first question.
ar: يرجى الإجابة عن سؤالك الأول.
hi: कृपया अपने पहले प्रश्न का उत्तर दें।

# registration.error.firstQuestionMissing
source: Choose your first question.
ar: اختر سؤالك الأول.
hi: अपना पहला प्रश्न चुनें।

# registration.error.goalMissing
source: Enter a goal, or tap Skip for now.
ar: أدخل هدفًا، أو اضغط تخطٍّ الآن.
hi: एक लक्ष्य दर्ज करें, या अभी के लिए छोड़ें पर टैप करें।

# registration.error.nameMissing
source: Please tell us your name.
ar: يرجى إخبارنا باسمك.
hi: कृपया हमें अपना नाम बताएँ।

# registration.error.passwordTooShort
source: Use at least 8 characters.
ar: استخدم 8 أحرف على الأقل.
hi: कम से कम 8 वर्णों का उपयोग करें।

# registration.error.passwordsDoNotMatch
source: Passwords don't match yet.
ar: كلمتا المرور غير متطابقتين بعد.
hi: पासवर्ड अभी मेल नहीं खाते।

# registration.error.phoneInvalid
source: Enter a valid phone number, or leave it blank.
ar: أدخل رقم هاتف صالحًا، أو اتركه فارغًا.
hi: एक मान्य फ़ोन नंबर दर्ज करें, या इसे खाली छोड़ दें।

# registration.error.salaryMissing
source: Enter your salary as a number.
ar: أدخل راتبك كرقم.
hi: अपना वेतन एक संख्या के रूप में दर्ज करें।

# registration.error.secondAnswerMissing
source: Please answer your second question.
ar: يرجى الإجابة عن سؤالك الثاني.
hi: कृपया अपने दूसरे प्रश्न का उत्तर दें।

# registration.error.secondQuestionMissing
source: Choose a second question.
ar: اختر سؤالًا ثانيًا.
hi: एक दूसरा प्रश्न चुनें।

# registration.error.secondQuestionRepeated
source: Your two questions need to be different.
ar: يجب أن يكون سؤالاك مختلفين.
hi: आपके दोनों प्रश्न अलग-अलग होने चाहिए।

# registration.error.termsNotAccepted
source: Please tick the Terms & Privacy Policy to continue.
ar: يرجى الموافقة على الشروط وسياسة الخصوصية للمتابعة.
hi: जारी रखने के लिए कृपया नियम और गोपनीयता नीति पर सही का निशान लगाएँ।

# registration.error.tooYoung
source: You need to be at least 16 to open an account.
ar: يجب أن يكون عمرك 16 عامًا على الأقل لفتح حساب.
hi: खाता खोलने के लिए आपकी आयु कम से कम 16 वर्ष होनी चाहिए।

# registration.name.label
source: Full name
ar: الاسم الكامل
hi: पूरा नाम

# registration.one.action
source: Register
ar: تسجيل
hi: पंजीकरण करें

# registration.one.stepLabel
source: Step 1 of 3
ar: الخطوة 1 من 3
hi: चरण 1 / 3

# registration.one.subtitle
source: First the basics — this is all we need to open your account.
ar: أولًا الأساسيات — هذا كل ما نحتاجه لفتح حسابك.
hi: पहले बुनियादी बातें — आपका खाता खोलने के लिए बस इतना ही चाहिए।

# registration.one.title.first
source: Start in a minute.
ar: ابدأ في دقيقة.
hi: एक मिनट में शुरू करें।

# registration.one.title.second
source: Build the habit for life.
ar: ابنِ العادة مدى الحياة.
hi: जीवन भर के लिए आदत बनाएँ।

# registration.password.label
source: Create password
ar: إنشاء كلمة المرور
hi: पासवर्ड बनाएँ

# registration.password.strength.fair
source: Fair
ar: مقبولة
hi: ठीक-ठाक

# registration.password.strength.good
source: Good
ar: جيدة
hi: अच्छा

# registration.password.strength.strong
source: Strong
ar: قوية
hi: मज़बूत

# registration.password.strength.weak
source: Weak
ar: ضعيفة
hi: कमज़ोर

# registration.phone.dial.accessibilityLabel
source: Change country code
ar: تغيير رمز الدولة
hi: देश कोड बदलें

# registration.phone.label
source: Phone number
ar: رقم الهاتف
hi: फ़ोन नंबर

# registration.reference.retry
source: Try again
ar: حاول مرة أخرى
hi: फिर से कोशिश करें

# registration.signIn.action
source: Sign in instead
ar: سجّل الدخول بدلًا من ذلك
hi: इसके बजाय साइन इन करें

# registration.signIn.prompt
source: Already with us? Welcome back!
ar: معنا بالفعل؟ أهلًا بعودتك!
hi: पहले से हमारे साथ हैं? वापसी पर स्वागत है!

# registration.terms
source: I agree to the Terms & Privacy Policy
ar: أوافق على الشروط وسياسة الخصوصية
hi: मैं नियम और गोपनीयता नीति से सहमत हूँ

# registration.terms.privacy
source: Read the Privacy Policy
ar: اقرأ سياسة الخصوصية
hi: गोपनीयता नीति पढ़ें

# registration.terms.terms
source: Read the Terms
ar: اقرأ الشروط
hi: नियम पढ़ें

# registration.three.action
source: Submit
ar: إرسال
hi: सबमिट करें

# registration.three.goal.label
source: Monthly savings goal
ar: هدف الادخار الشهري
hi: मासिक बचत लक्ष्य

# registration.three.hint.above %@
source: That's %@%% of your salary — ahead of the 20%% rule. Nice.
ar: هذا %@%% من راتبك — أعلى من قاعدة الـ 20%%. رائع.
hi: यह आपके वेतन का %@%% है — 20%% के नियम से आगे। बढ़िया।

# registration.three.hint.below %@
source: That's %@%% of your salary — a little under the 20%% rule, but a start is a start.
ar: هذا %@%% من راتبك — أقل قليلًا من قاعدة الـ 20%%، لكن البداية بداية.
hi: यह आपके वेतन का %@%% है — 20%% के नियम से थोड़ा कम, पर शुरुआत तो शुरुआत है।

# registration.three.hint.empty
source: Leave this blank and tap Skip for now to use the suggested amount.
ar: اترك هذا فارغًا واضغط تخطٍّ الآن لاستخدام المبلغ المقترح.
hi: इसे खाली छोड़ें और सुझाई गई राशि उपयोग करने के लिए अभी के लिए छोड़ें पर टैप करें।

# registration.three.hint.onTarget %@
source: That's %@%% of your salary — right on the rule.
ar: هذا %@%% من راتبك — مطابق تمامًا للقاعدة.
hi: यह आपके वेतन का %@%% है — नियम के बिल्कुल अनुसार।

# registration.three.perMonth
source: a month
ar: شهريًا
hi: प्रति माह

# registration.three.rule.body
source: A well-tested rule of thumb is to put 20% of your salary towards savings each month. Based on the salary you gave us, that comes to:
ar: قاعدة مجرّبة جيدًا هي ادخار 20% من راتبك كل شهر. بناءً على الراتب الذي أدخلته، يبلغ ذلك:
hi: एक अच्छी तरह से आज़माया गया नियम है कि हर महीने अपने वेतन का 20% बचत में डालें। आपने जो वेतन बताया, उसके आधार पर यह बनता है:

# registration.three.rule.eyebrow
source: The 20% rule
ar: قاعدة الـ 20%
hi: 20% का नियम

# registration.three.rule.footer
source: If you're happy with this amount, put it in below. Otherwise enter a value of your own — you can change it any time from your account.
ar: إذا كنت راضيًا عن هذا المبلغ، أدخله أدناه. وإلا فأدخل قيمة خاصة بك — يمكنك تغييرها في أي وقت من حسابك.
hi: यदि आप इस राशि से संतुष्ट हैं, तो इसे नीचे डालें। अन्यथा अपनी कोई राशि दर्ज करें — आप इसे अपने खाते से किसी भी समय बदल सकते हैं।

# registration.three.skip
source: Skip for now
ar: تخطٍّ الآن
hi: अभी के लिए छोड़ें

# registration.three.stepLabel
source: Step 3 of 3
ar: الخطوة 3 من 3
hi: चरण 3 / 3

# registration.three.subtitle
source: One number to aim at each month. Change it whenever you like.
ar: رقم واحد تستهدفه كل شهر. غيّره متى شئت.
hi: हर महीने एक लक्ष्य संख्या। जब चाहें इसे बदलें।

# registration.three.title.first
source: Set up your goals.
ar: حدّد أهدافك.
hi: अपने लक्ष्य तय करें।

# registration.three.title.second
source: Small and steady wins.
ar: القليل المنتظم يفوز.
hi: छोटा और नियमित ही जीतता है।

# registration.three.useSuggested
source: Use the suggested amount
ar: استخدم المبلغ المقترح
hi: सुझाई गई राशि उपयोग करें

# registration.two.action
source: Next
ar: التالي
hi: आगे

# registration.two.answer.one.label
source: Your answer
ar: إجابتك
hi: आपका उत्तर

# registration.two.answer.two.label
source: Your answer
ar: إجابتك
hi: आपका उत्तर

# registration.two.currency.hint
source: All your budgets, totals and reports will be shown in this currency.
ar: ستُعرض جميع ميزانياتك وإجمالياتك وتقاريرك بهذه العملة.
hi: आपके सभी बजट, कुल और रिपोर्ट इसी मुद्रा में दिखाए जाएँगे।

# registration.two.currency.label
source: Currency
ar: العملة
hi: मुद्रा

# registration.two.currency.placeholder
source: Choose a currency
ar: اختر عملة
hi: एक मुद्रा चुनें

# registration.two.currency.search
source: Search currency or code
ar: ابحث عن عملة أو رمز
hi: मुद्रा या कोड खोजें

# registration.two.currency.title
source: Select currency
ar: اختر العملة
hi: मुद्रा चुनें

# registration.two.money.section
source: Your money
ar: أموالك
hi: आपका पैसा

# registration.two.question.one.label
source: Question 1
ar: السؤال 1
hi: प्रश्न 1

# registration.two.question.one.title
source: Security question 1
ar: سؤال الأمان 1
hi: सुरक्षा प्रश्न 1

# registration.two.question.placeholder
source: Choose a question
ar: اختر سؤالًا
hi: एक प्रश्न चुनें

# registration.two.question.search
source: Search questions
ar: ابحث عن الأسئلة
hi: प्रश्न खोजें

# registration.two.question.two.label
source: Question 2
ar: السؤال 2
hi: प्रश्न 2

# registration.two.question.two.title
source: Security question 2
ar: سؤال الأمان 2
hi: सुरक्षा प्रश्न 2

# registration.two.salary.label
source: Monthly salary
ar: الراتب الشهري
hi: मासिक वेतन

# registration.two.security.hint
source: If you ever lose access to your email and phone, these two answers are how we know it's really you.
ar: إذا فقدت يومًا إمكانية الوصول إلى بريدك وهاتفك، فهاتان الإجابتان هما كيف نعرف أنك أنت حقًا.
hi: यदि आप कभी अपने ईमेल और फ़ोन तक पहुँच खो दें, तो ये दो उत्तर ही हैं जिनसे हम जानते हैं कि यह सचमुच आप हैं।

# registration.two.security.section
source: Security questions
ar: أسئلة الأمان
hi: सुरक्षा प्रश्न

# registration.two.stepLabel
source: Step 2 of 3
ar: الخطوة 2 من 3
hi: चरण 2 / 3

# registration.two.subtitle
source: Your currency, your salary, and two questions that keep the account yours.
ar: عملتك وراتبك وسؤالان يبقيان الحساب لك.
hi: आपकी मुद्रा, आपका वेतन, और दो प्रश्न जो खाते को आपका बनाए रखते हैं।

# registration.two.title.first
source: Nearly there.
ar: أوشكت على الانتهاء.
hi: बस पहुँचने ही वाले हैं।

# registration.two.title.second
source: Now the money bit.
ar: الآن الجزء المتعلق بالمال.
hi: अब पैसे वाला हिस्सा।

# reports.detail.empty
source: This month's report is not available.
ar: تقرير هذا الشهر غير متاح.
hi: इस महीने की रिपोर्ट उपलब्ध नहीं है।

# reports.detail.entries.caption
source: Everything you logged
ar: كل ما سجّلته
hi: आपके द्वारा दर्ज सब कुछ

# reports.detail.entries.collapse
source: Hides the entries
ar: يُخفي الإدخالات
hi: प्रविष्टियाँ छिपाता है

# reports.detail.entries.expand
source: Shows the entries
ar: يُظهر الإدخالات
hi: प्रविष्टियाँ दिखाता है

# reports.detail.entries.hint
source: Tap to see entries
ar: اضغط لرؤية الإدخالات
hi: प्रविष्टियाँ देखने के लिए टैप करें

# reports.detail.entries.noIncome
source: No extra income that month — salary only.
ar: لا دخل إضافي ذلك الشهر — الراتب فقط.
hi: उस महीने कोई अतिरिक्त आय नहीं — केवल वेतन।

# reports.detail.entries.none %@
source: Nothing was logged under %@ that month.
ar: لم يُسجَّل شيء ضمن %@ ذلك الشهر.
hi: उस महीने %@ के अंतर्गत कुछ दर्ज नहीं हुआ।

# reports.detail.eyebrow
source: Monthly report
ar: تقرير شهري
hi: मासिक रिपोर्ट

# reports.detail.fact.biggestCost
source: Biggest cost
ar: أكبر تكلفة
hi: सबसे बड़ा खर्च

# reports.detail.fact.goal
source: Savings goal
ar: هدف الادخار
hi: बचत लक्ष्य

# reports.detail.fact.leftOver
source: Left over
ar: المتبقّي
hi: बचा हुआ

# reports.detail.fact.needs
source: Needs
ar: الاحتياجات
hi: ज़रूरतें

# reports.detail.fact.salary
source: Salary that month
ar: راتب ذلك الشهر
hi: उस महीने का वेतन

# reports.detail.fact.saved
source: Actually saved
ar: المدَّخر فعليًا
hi: वास्तव में बचाया

# reports.detail.facts.caption
source: For the record
ar: للتوثيق
hi: रिकॉर्ड के लिए

# reports.detail.note.adapted %@ %@
source: Rent, bills and food came to %1$@ — more than half your %2$@ income, so the rest was split evenly between wants and savings.
ar: بلغ الإيجار والفواتير والطعام %1$@ — أكثر من نصف دخلك البالغ %2$@، لذا قُسِّم الباقي بالتساوي بين الرغبات والادخار.
hi: किराया, बिल और भोजन मिलाकर %1$@ हुए — आपकी %2$@ आय के आधे से अधिक, इसलिए बाकी को इच्छाओं और बचत के बीच समान रूप से बाँटा गया।

# reports.detail.note.plain
source: Your needs fitted inside half your income, so the full 50 / 30 / 20 rule applied that month.
ar: استوعب نصف دخلك احتياجاتك، لذا طُبِّقت قاعدة 50 / 30 / 20 كاملة ذلك الشهر.
hi: आपकी ज़रूरतें आपकी आधी आय के भीतर आ गईं, इसलिए उस महीने पूरा 50 / 30 / 20 नियम लागू हुआ।

# reports.detail.savings.caption
source: Savings that month
ar: مدخرات ذلك الشهر
hi: उस महीने की बचत

# reports.detail.savings.foot.exact %@
source: You set aside %@ — exactly the goal.
ar: ادّخرت %@ — الهدف تمامًا.
hi: आपने %@ अलग रखा — बिल्कुल लक्ष्य के बराबर।

# reports.detail.savings.foot.over %@ %@
source: You set aside %1$@ — the whole goal, and %2$@ over.
ar: ادّخرت %1$@ — كامل الهدف، و%2$@ زيادة.
hi: आपने %1$@ अलग रखा — पूरा लक्ष्य, और %2$@ अधिक।

# reports.detail.savings.foot.short %@ %@
source: You set aside %1$@, %2$@ short of the goal.
ar: ادّخرت %1$@، بنقص %2$@ عن الهدف.
hi: आपने %1$@ अलग रखा, लक्ष्य से %2$@ कम।

# reports.detail.savings.meter.accessibilityValue %@ %@ %@
source: %1$@ of a %2$@ goal, %3$@
ar: %1$@ من هدف قدره %2$@، %3$@
hi: %2$@ के लक्ष्य में से %1$@, %3$@

# reports.detail.spending.caption
source: Where your money went
ar: إلى أين ذهبت أموالك
hi: आपका पैसा कहाँ गया

# reports.detail.spending.nothingLogged
source: Nothing was logged that month, so there is no split to show.
ar: لم يُسجَّل شيء ذلك الشهر، لذا لا يوجد توزيع لعرضه.
hi: उस महीने कुछ दर्ज नहीं हुआ, इसलिए दिखाने के लिए कोई विभाजन नहीं है।

# reports.detail.spending.total
source: Total spent
ar: إجمالي المصروف
hi: कुल खर्च

# reports.detail.split.accessibilityLabel
source: Where the month's income went
ar: إلى أين ذهب دخل الشهر
hi: महीने की आय कहाँ गई

# reports.detail.split.caption
source: How the month's money split
ar: كيف توزّعت أموال الشهر
hi: महीने का पैसा कैसे बँटा

# reports.detail.split.needs
source: Needs
ar: الاحتياجات
hi: ज़रूरतें

# reports.detail.split.saved
source: Savings
ar: الادخار
hi: बचत

# reports.detail.split.sub %@
source: of %@ in
ar: من أصل %@
hi: %@ में से

# reports.detail.split.surplus
source: Above goal
ar: فوق الهدف
hi: लक्ष्य से ऊपर

# reports.detail.split.target %@
source: aim %@
ar: الهدف %@
hi: लक्ष्य %@

# reports.detail.split.wants
source: Wants
ar: الرغبات
hi: इच्छाएँ

# reports.detail.summary.additionalIncome
source: Extra in
ar: دخل إضافي
hi: अतिरिक्त आय

# reports.detail.summary.caption
source: Total spent
ar: إجمالي المصروف
hi: कुल खर्च

# reports.detail.summary.fixed
source: Fixed
ar: ثابت
hi: निश्चित

# reports.detail.summary.variable
source: Variable
ar: متغيّر
hi: परिवर्तनशील

# reports.detail.wants.accessibilityValue %@ %@ %@
source: %1$@ of %2$@ allowed, %3$@
ar: %1$@ من %2$@ مسموح، %3$@
hi: अनुमत %2$@ में से %1$@, %3$@

# reports.detail.wants.accessibilityValue.over %@ %@ %@
source: %1$@ of %2$@ allowed, %3$@ — over the allowance
ar: %1$@ من %2$@ مسموح، %3$@ — تجاوز الحد المسموح
hi: अनुमत %2$@ में से %1$@, %3$@ — अनुमत सीमा से अधिक

# reports.detail.wants.allowance %@
source: of %@ allowed
ar: من %@ مسموح
hi: अनुमत %@ में से

# reports.detail.wants.caption
source: Spent on wants
ar: المصروف على الرغبات
hi: इच्छाओं पर खर्च
